Revit 2027 API
ControlledApplication.CurrentUserAddinsLocation Property
 The folder location for .addin files for the current user.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string CurrentUserAddinsLocation { get; }
Public ReadOnly Property CurrentUserAddinsLocation As String
	Get
public:
property String^ CurrentUserAddinsLocation {
	String^ get ();
}
member CurrentUserAddinsLocation : string with get
Property Value
String
See Also
Reference
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace